---
kind: method
id: M:Autodesk.Revit.DB.ExportLayerInfo.#ctor
source: html/2cabf696-8fd0-0395-030f-9c622840cc35.htm
---
# Autodesk.Revit.DB.ExportLayerInfo.#ctor Method

Constructs a new ExportLayerInfo with default values.

## Syntax (C#)
```csharp
public ExportLayerInfo()
```